app/views/messages/new.html.erb

      <%= f.label :to_user %>
      <%= collection_select(:message, :to_user_id, User.all, :id, :name, {} ) %>
---
SELECT "users".* FROM "users"