app/controllers/messages_controller.rb

  def create
    @message = Message.new( message_params )
    if @message.save
---
INSERT INTO "messages" ("message", "from_user_id", "to_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "akjfsdbk ajfsdkj askdfjg askdjfgkasdjgf asdf "], ["from_user_id", 1], ["to_user_id", 1], ["created_at", 2017-01-07 01:12:11 UTC], ["updated_at", 2017-01-07 01:12:11 UTC]]