app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new( user_params )
    if @user.save